<html>
<head>
    <title>Introducci&oacute;n a la Programaci&oacute;n</title>
    <style>
        body {
            background-color: #bde0e0;
            font-family: Arial, sans-serif;
            margin: 20px;
        }
        h1, h2, h3, h4 {
            text-align: center;
        }

        blockquote {
            margin-left: 20px;
            margin-right: 20px;
        }
        a {
            text-decoration: none;
            color: blue;
        }
        a:hover {
            text-decoration: underline;
        }
        p {
            text-align: justify;
        }
    </style>
</head>
<body>
    <h1><a name="arriba" id="arriba"></a>CBTis 116</h1>
    <h2>Introducci&oacute;n a la Programaci&oacute;n</h2>
    <h3>Alumno: Gatica Huerta Jon&aacute;s, Gonz&aacute;les Quezada Isabel</h3>
    <h4>Profesor: Ing. Constantino Solis Quinteros</h4>
    <hr />
    <blockquote>
        <blockquote>
            <h2>Introducci&oacute;n a la Programaci&oacute;n</h2>
            <h2><a href="#subtema1">&iquest;Qu&eacute; es la programaci&oacute;n?</a></h2>
            <h2><a href="#subtema2">Lenguajes de programaci&oacute;n</a></h2>
            <h2><a href="#subtema3">Estructuras b&aacute;sicas de un programa</a></h2>
            <h2><a href="#subtema4">Algoritmos y pseudoc&oacute;digo</a></h2>
            <h2><a href="#subtema5">Depuraci&oacute;n y pruebas</a></h2>
            <p>&nbsp;</p>
        </blockquote>

        <!-- Subtema 1 -->
        <p><a name="subtema1" id="subtema1"></a><strong>&iquest;Qu&eacute; es la programaci&oacute;n?</strong></p>
        <p>
            La programaci&oacute;n es el proceso fundamental mediante el cual se crean instrucciones que una computadora puede entender y ejecutar para realizar tareas espec&iacute;ficas. Es una de  las habilidades esenciales en el mundo actual, ya que permite desarrollar software, aplicaciones, p&aacute;ginas web y sistemas que facilitan la vida diaria y el trabajo en diversas &aacute;reas. 
            En t&eacute;rminos simples, programar es escribir un conjunto de pasos o comandos que indican a la computadora qu&eacute; hacer. Estos pasos se escriben en un lenguaje que la m&aacute;quina pueda interpretar, conocido como lenguaje de programaci&oacute;n.        
        </p>
        <p>
            La programaci&oacute;n no solo implica escribir c&oacute;digo, sino tambi&eacute;n pensar de manera l&oacute;gica y estructurada para resolver problemas. Aprender a programar ayuda a desarrollar habilidades de pensamiento cr&iacute;tico, an&aacute;lisis y resoluci&oacute;n de problemas. Adem&aacute;s, es una puerta de entrada a muchas carreras tecnol&oacute;gicas y cient&iacute;ficas. 
            En la educaci&oacute;n preparatoria, la programaci&oacute;n se introduce para que los estudiantes comprendan los conceptos b&aacute;sicos y puedan aplicarlos en proyectos sencillos, prepar&aacute;ndolos para el futuro. El conocimiento de la programaci&oacute;n abre un abanico de oportunidades profesionales en &aacute;reas como la inteligencia artificial, la ciencia de datos, la ciberseguridad y el desarrollo de videojuegos.
        </p>
        <p>
            En la educaci&oacute;n, la programaci&oacute;n se est&aacute; convirtiendo en un pilar, ya que proporciona a los estudiantes una comprensi&oacute;n de c&oacute;mo funciona el mundo tecnol&oacute;gico que los rodea y los prepara para carreras del futuro. M&aacute;s all&aacute; de la escritura de c&oacute;digo, la programaci&oacute;n es una disciplina que fomenta el pensamiento l&oacute;gico y estructurado. 
            Los programadores deben desglosar problemas grandes en partes m&aacute;s pequeñas y manejables, un proceso conocido como pensamiento computacional. Esta habilidad de resoluci&oacute;n de problemas es valiosa en muchos campos, no solo en la tecnolog&iacute;a. Aprender a programar ayuda a desarrollar la paciencia, la atenci&oacute;n al detalle y la capacidad de depurar o corregir errores en el c&oacute;digo.
        </p>
        <p><a href="#arriba">Regresar</a></p>

        <!-- Subtema 2 -->
        <blockquote>
            <p><a name="subtema2" id="subtema2"></a><strong>Lenguajes de programaci&oacute;n</strong></p>
        </blockquote>
        <p>
           Los lenguajes de programaci&oacute;n son las herramientas esenciales que los desarrolladores utilizan para comunicarse con las computadoras, estos act&uacute;an traduciendo ideas en instrucciones que estas m&aacute;quinas pueden ejecutar. Cada uno de estos lenguajes posee un conjunto &uacute;nico de caracter&iacute;sticas, lo que los hace adecuados para distintos prop&oacute;sitos. 
           Por ejemplo, algunos est&aacute;n diseñados para ser accesibles y facilitar el aprendizaje a gente quienes se inician en el mundo de la programaci&oacute;n, mientras que otros est&aacute;n optimizados para manejar tareas de alta complejidad, ofreciendo un poder y una flexibilidad superiores. 
           La elecci&oacute;n del lenguaje adecuado depende en gran medida del objetivo del proyecto y del nivel de experiencia del programador. 
        </p>
        <p>
            Dentro de la amplia gama de lenguajes disponibles, algunos destacan por su popularidad y su idoneidad para principiantes. Python, por ejemplo, es muy apreciado por su sintaxis intuitiva y legible, lo que lo convierte en una excelente opci&oacute;n para quienes dan sus primeros pasos en el c&oacute;digo. 
            JavaScript es otro lenguaje fundamental, particularmente en el desarrollo web, ya que es el motor detr&aacute;s de la interactividad en la mayor&iacute;a de los sitios en internet. Para los m&aacute;s j&oacute;venes, Scratch ofrece una introducci&oacute;n l&uacute;dica y efectiva, utilizando un enfoque de bloques visuales que simplifica la comprensi&oacute;n de conceptos abstractos.
        </p>
        <p>
            A pesar de sus diferencias, todos los lenguajes de programaci&oacute;n comparten un conjunto de principios fundamentales. Conceptos como variables (para almacenar datos), condiciones (para tomar decisiones), ciclos (para repetir acciones) y funciones (para organizar el c&oacute;digo) son la base de la programaci&oacute;n. 
            Dominar estos conceptos permite a los programadores escribir c&oacute;digo en cualquier lenguaje, ya que la l&oacute;gica subyacente es la misma. Aprender y practicar con m&uacute;ltiples lenguajes no solo ampl&iacute;a las capacidades de un programador para desarrollar una variedad de aplicaciones, sino que tambi&eacute;n profundiza su comprensi&oacute;n del funcionamiento interno de las computadoras.
        </p>
        <p><a href="#arriba">Regresar</a></p>

        <!-- Subtema 3 -->
        <blockquote>
            <p><a name="subtema3" id="subtema3"></a><strong>Estructuras b&aacute;sicas de un programa</strong></p>
        </blockquote>
        <p>
            Un programa inform&aacute;tico se construye a partir de elementos fundamentales que controlan su comportamiento y la forma en que procesa la informaci&oacute;n. Estas estructuras b&aacute;sicas, conocidas como control de flujo y manipulaci&oacute;n de datos, son esenciales para dar forma a la l&oacute;gica del software. 
            Las principales de estas estructuras son las variables, las condiciones, los ciclos y las funciones, esto varia dependiendo del lenguaje que se use.
        </p>
        <p>
            Las variables act&uacute;an como contenedores en la memoria de la computadora, destinados a almacenar datos que pueden cambiar a lo largo de la ejecuci&oacute;n del programa. 
            Estos datos pueden ser de diversos tipos, como n&uacute;meros (enteros o decimales), texto (cadenas de caracteres) o valores l&oacute;gicos (verdadero o falso), conocidos como booleanos. El uso de variables es crucial, ya que permite que los programas sean din&aacute;micos y capaces de procesar informaci&oacute;n variable, en lugar de trabajar con valores fijos.
        </p>
        <p>
            Las condiciones son el mecanismo que dota a los programas de la capacidad de tomar decisiones. A trav&eacute;s de expresiones l&oacute;gicas, un programa puede evaluar si una determinada condici&oacute;n es verdadera o falsa. 
            Dependiendo del resultado, se ejecutar&aacute; un bloque de c&oacute;digo u otro. Esto se implementa com&uacute;nmente con sentencias como if y else, que dirigen el flujo del programa por diferentes caminos seg&uacute;n la informaci&oacute;n que se est&eacute; procesando.
        </p>
        <p>
            Para la repetici&oacute;n de tareas, se utilizan los ciclos o bucles. Estas estructuras permiten ejecutar un mismo conjunto de instrucciones varias veces de manera eficiente, siempre y cuando se cumpla una condici&oacute;n preestablecida. Los ciclos m&aacute;s comunes son los bucles for y while. 
            Por &uacute;ltimo, las funciones son piezas de c&oacute;digo diseñadas para realizar una tarea espec&iacute;fica y que pueden ser llamadas y reutilizadas en cualquier parte del programa. Esto no solo organiza el c&oacute;digo, sino que tambi&eacute;n lo hace m&aacute;s f&aacute;cil de mantener y entender.
        </p>
        <p><a href="#arriba">Regresar</a></p>

        <!-- Subtema 4 -->
        <blockquote>
            <p><a name="subtema4" id="subtema4"></a><strong>Algoritmos y pseudoc&oacute;digo</strong></p>
        </blockquote>
        <p>
            Para planificar la creaci&oacute;n de software, es fundamental comenzar con la l&oacute;gica detr&aacute;s del programa antes de escribir una sola l&iacute;nea de c&oacute;digo. Este proceso se apoya en dos herramientas clave: los algoritmos y el pseudoc&oacute;digo. 
            Un algoritmo es una secuencia de pasos bien definidos y finitos que describen con exactitud c&oacute;mo se debe resolver un problema o completar una tarea. Es la hoja de ruta que garantiza que el proceso de programaci&oacute;n sea claro, l&oacute;gico y eficiente.
        </p>
        <p>
            El pseudoc&oacute;digo es el lenguaje que se utiliza para expresar estos algoritmos de una manera estructurada pero informal. Se asemeja al lenguaje natural, lo que lo hace f&aacute;cil de entender, pero incluye palabras clave y estructuras de programaci&oacute;n b&aacute;sicas. 
            No se rige por las estrictas reglas de sintaxis de un lenguaje de programaci&oacute;n real, lo cual permite a los programadores concentrarse por completo en la l&oacute;gica del problema. Esta flexibilidad es invaluable, ya que facilita la comunicaci&oacute;n de ideas entre equipos y permite perfeccionar la soluci&oacute;n antes de entrar en la fase de codificaci&oacute;n.
        </p>
        <p>
            Este m&eacute;todo de planificaci&oacute;n es crucial para evitar errores y optimizar el tiempo de desarrollo. Al desglosar un problema en pasos sencillos, como "Leer n&uacute;mero 1", "Leer n&uacute;mero 2", "Sumar ambos n&uacute;meros" y "Mostrar el resultado", se puede validar la l&oacute;gica del programa de forma visual. 
            Este proceso ayuda a los desarrolladores a entender la esencia del problema y a construir una base s&oacute;lida para el c&oacute;digo, asegurando que la implementaci&oacute;n final sea robusta y funcione como se espera. El tiempo invertido en la planificaci&oacute;n con algoritmos y pseudoc&oacute;digo es un ahorro significativo a largo plazo, ya que reduce la necesidad de corregir errores en etapas avanzadas del proyecto y mejora la calidad del c&oacute;digo final. 
            Al invertir en esta etapa, el proceso de codificaci&oacute;n se vuelve m&aacute;s fluido y menos propenso a errores.
        </p>
        <p><a href="#arriba">Regresar</a></p>

        <!-- Subtema 5 -->
        <blockquote>
            <p><a name="subtema5" id="subtema5"></a><strong>Depuraci&oacute;n y pruebas</strong></p>
        </blockquote>
        <p>
            La depuraci&oacute;n, o debugging, es un proceso esencial en el desarrollo de software. Consiste en encontrar y corregir los errores o "bugs" que impiden que un programa funcione correctamente. Es una fase cr&iacute;tica, ya que es pr&aacute;cticamente imposible escribir c&oacute;digo complejo sin cometer fallos. 
            Por eso, la etapa de pruebas es fundamental para garantizar que el software cumple con su prop&oacute;sito y ofrece una experiencia de usuario confiable y sin fallas inesperadas. La importancia de esta etapa no puede subestimarse, pues un programa sin errores es la base de un producto de calidad.
        </p>
        <p>
            Existen diversas metodolog&iacute;as para probar y depurar el c&oacute;digo. Las pruebas pueden ser manuales, donde el programador ejecuta el programa y verifica manualmente los resultados, o autom&aacute;ticas, utilizando herramientas especializadas que ejecutan series de pruebas predefinidas para validar una amplia gama de funcionalidades. 
            Durante la depuraci&oacute;n, un desarrollador puede utilizar diversas t&eacute;cnicas, como la revisi&oacute;n minuciosa del c&oacute;digo l&iacute;nea por l&iacute;nea, la inserci&oacute;n de mensajes de registro para rastrear el flujo de ejecuci&oacute;n o el uso de herramientas de depuraci&oacute;n avanzadas que permiten inspeccionar el estado del programa en tiempo real. Estas herramientas son una ayuda invaluable para identificar la causa ra&iacute;z de los problemas de manera eficiente.
        </p>
        <p>
            Dominar la habilidad de depurar y probar programas no solo es crucial para la creaci&oacute;n de software confiable y eficiente, sino que tambi&eacute;n es un factor clave en el desarrollo profesional de un programador. Este proceso fomenta la paciencia, la atenci&oacute;n al detalle y un pensamiento anal&iacute;tico m&aacute;s agudo. 
            Al enfrentar y solucionar problemas en el c&oacute;digo, se adquiere una comprensi&oacute;n m&aacute;s profunda de c&oacute;mo funciona la l&oacute;gica de un programa y se mejora la capacidad de escribir c&oacute;digo m&aacute;s robusto y de alta calidad. La depuraci&oacute;n, lejos de ser una tarea tediosa, es una oportunidad invaluable para aprender, perfeccionar las habilidades de programaci&oacute;n y asegurar la entrega de un producto final de alta calidad a los usuarios. 
            Con cada error corregido, el programador gana experiencia y confianza en su trabajo.
        </p>
        <p><a href="#arriba">Regresar</a></p>
    </blockquote>
</body>
</html>
